---
kind: type
id: T:Autodesk.Revit.DB.FabricationServiceButton
source: html/6a21f232-3a37-239b-8bb1-a8b02f2984ec.htm
---
# Autodesk.Revit.DB.FabricationServiceButton

The object contains information about a fabricaton button.

## Syntax (C#)
```csharp
public class FabricationServiceButton : IDisposable
```

## Remarks
A fabrication service button defines what items to use for different conditions. Fabrication service buttons are part of a fabrication service.